In [70]:
import pandas as pd
import numpy as np
import seaborn as sns
import sqlite3
import zipfile
import matplotlib.pyplot as plt

In [71]:
import zipfile
import os

#zip_path = 'C:\\Users\\emmam\\Documents\\Flatiron\\phase_2\\movies-analysis\\zippedData\\im.db.zip' # Replace with your zip file name
#db_name = 'im.db'
#extract_to_path = 'C:\\Users\\emmam\\Documents\\Flatiron\\phase_2\\movies-analysis\\zippedData'

#extracted_file_path = os.path.join(extract_to_path, db_name)

#if os.path.exists(extracted_file_path):
    #print(f"File already exists: {extracted_file_path}")
    #try:
        #os.remove(extracted_file_path)
        #print("Existing file deleted.")
    #except PermissionError as e:
        #print(f"Could not delete the existing file due to: {e}")
        #exit()  # Exit the script to avoid trying to extract

# Extract the database file from the zip file
#with zipfile.ZipFile(zip_path, 'r') as zip_ref:
    #zip_ref.extract(db_name, extract_to_path)

#print("Extraction completed.")

In [72]:
import zipfile
import os

#zip_path = 'C:\\Users\\emmam\\Documents\\Flatiron\\phase_2\\movies-analysis\\zippedData\\im.db.zip' 
#db_name = 'im.db'
#extract_to_path = 'C:\\Users\\emmam\\Documents\\Flatiron\\phase_2\\movies-analysis\\zippedData'

#extracted_file_path = os.path.join(extract_to_path, db_name)

#if os.path.exists(extracted_file_path):
    #print(f"File already exists: {extracted_file_path}")

# Extract the database file from the zip file
#with zipfile.ZipFile(zip_path, 'r') as zip_ref:
    #zip_ref.extract(db_name, extract_to_path)

#print("Extraction completed.")

In [73]:
cd

C:\Users\emmam

In [74]:
cd Documents

C:\Users\emmam\Documents

In [75]:
cd Flatiron

C:\Users\emmam\Documents\Flatiron

In [76]:
cd phase_2

C:\Users\emmam\Documents\Flatiron\phase_2

In [77]:
cd film-analytics

C:\Users\emmam\Documents\Flatiron\phase_2\film-analytics

In [78]:
cd data

C:\Users\emmam\Documents\Flatiron\phase_2\film-analytics\data

In [79]:
conn = sqlite3.connect('im.db')

In [80]:
pd.read_sql("""SELECT name FROM sqlite_master WHERE type='table';""", conn)

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [81]:
pd.read_sql("""SELECT genres, averagerating 
FROM movie_basics
JOIN movie_ratings ON movie_basics.movie_id = movie_ratings.movie_id
GROUP BY genres
ORDER BY averagerating DESC
LIMIT 10;""", conn)

                       genres  averagerating
0  Documentary,Family,Romance            9.7
1    Comedy,Documentary,Sport            9.7
2  Comedy,Documentary,Fantasy            9.4
3  Documentary,Family,Musical            9.3
4               History,Sport            9.2
5     Documentary,History,War            9.2
6     Crime,Documentary,Drama            9.2
7    Action,Documentary,Sport            9.2
8  Comedy,Documentary,Romance            9.1
9                         War            9.0

In [82]:
imdb_votes_grouped = pd.read_sql("""SELECT genres, AVG(averagerating) AS average_rating, AVG(numvotes) AS average_votes
FROM movie_basics
JOIN movie_ratings ON movie_basics.movie_id = movie_ratings.movie_id
JOIN movie_akas ON movie_ratings.movie_id = movie_akas.movie_id
WHERE genres LIKE '%drama%'
GROUP BY genres
ORDER BY average_rating DESC;""", conn)

In [83]:
imdb_votes_grouped.head()

                         genres  average_rating  average_votes
0       Comedy,Drama,Reality-TV        8.800000      15.000000
1    Documentary,Drama,Thriller        8.275000      26.937500
2     Documentary,Drama,Musical        8.245455     333.909091
3  Documentary,Drama,Reality-TV        7.950000      12.000000
4            Drama,History,News        7.800000       6.000000

In [84]:
pd.read_sql("""SELECT AVG(averagerating) AS cumulative_average_rating
FROM movie_basics
JOIN movie_ratings ON movie_basics.movie_id = movie_ratings.movie_id
WHERE genres LIKE '%horror%'""", conn)

   cumulative_average_rating
0                    5.00344

In [85]:
import os
print(os.getcwd())

C:\Users\emmam\Documents\Flatiron\phase_2\film-analytics\data

In [86]:
movie_gross = pd.read_csv('bom.movie_gross.csv.gz')
movie_info = pd.read_csv('rt.movie_info.tsv.gz', delimiter='\t')
movie_reviews = pd.read_csv('rt.reviews.tsv.gz', delimiter='\t', encoding='latin-1')
movie_votes = pd.read_csv('tmdb.movies.csv.gz')
movie_budgets = pd.read_csv('tn.movie_budgets.csv.gz')

In [87]:
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [88]:
movie_info.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [89]:
movie_reviews.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [90]:
movie_votes.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [91]:
movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [92]:
movie_gross.shape

(3387, 5)

In [93]:
movie_gross.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [94]:
movie_gross.dtypes

title              object
studio             object
domestic_gross    float64
foreign_gross      object
year                int64
dtype: object

In [95]:
movie_gross.drop('foreign_gross', axis=1, inplace=True)

In [96]:
def drop_nans(df, column_name):
    """
    Drop NaNs from specified columns from a Pandas DataFrame.

    :param df: Pandas DataFrame from which NaNs will be dropped.
    :param column_name: Target column.
    """
    df.dropna(subset=column_name, inplace=True)


drop_nans(movie_gross, ['domestic_gross', 'studio'])

In [97]:
movie_gross.columns

Index(['title', 'studio', 'domestic_gross', 'year'], dtype='object')

In [98]:
movie_info.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [99]:
def drop_columns(df, columns_to_drop):
    """
    Drop specified columns from a Pandas DataFrame.

    :param df: Pandas DataFrame from which columns will be dropped.
    :param columns_to_drop: List of column names to drop.
    """
    df.drop(columns=columns_to_drop, inplace=True)
    
drop_columns(movie_info, ['synopsis', 'currency', 'box_office', 'studio', 'theater_date', 'dvd_date', 'writer'])

In [100]:
movie_info.isna().sum()

id            0
rating        3
genre         8
director    199
runtime      30
dtype: int64

In [101]:
drop_nans(movie_info, ['rating', 'genre', 'runtime'])

In [102]:
movie_info.isna().sum()

id            0
rating        0
genre         0
director    182
runtime       0
dtype: int64

In [103]:
movie_budgets.columns

Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

In [104]:
movie_budgets['domestic_gross'] = movie_budgets['domestic_gross'].str.replace(',', '').str.strip('$')
movie_budgets['domestic_gross'] = movie_budgets['domestic_gross'].astype(float)
movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].str.replace(',', '').str.strip('$')
movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].astype(float)
movie_budgets['production_budget'] = movie_budgets['production_budget'].str.replace(',', '').str.strip('$')
movie_budgets['production_budget'] = movie_budgets['production_budget'].astype(float)

In [105]:
movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   float64
 4   domestic_gross     5782 non-null   float64
 5   worldwide_gross    5782 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 271.2+ KB

In [106]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3356 entries, 0 to 3386
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3356 non-null   object
 1   studio          3356 non-null   object
 2   domestic_gross  3356 non-null   float64
 3   year            3356 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 131.1+ KB

In [107]:
movie_budgets['movie'] = movie_budgets['movie'].str.strip().str.lower()
movie_budgets.rename(columns={'movie': 'title'}, inplace=True)

In [108]:
movie_gross['title'] = movie_gross['title'].str.strip().str.lower()

In [109]:
movie_budgets_gross = pd.merge(movie_gross, movie_budgets, how='inner', on='title')
movie_budgets_gross.shape

(1284, 9)

In [110]:
movie_budgets_gross.head()

,title,studio,domestic_gross_x,year,id,release_date,production_budget,domestic_gross_y,worldwide_gross
0,toy story 3,BV,415000000.0,2010,47,"Jun 18, 2010",200000000.0,415004880.0,1.068880e+09
1,inception,WB,292600000.0,2010,38,"Jul 16, 2010",160000000.0,292576195.0,8.355246e+08
2,shrek forever after,P/DW,238700000.0,2010,27,"May 21, 2010",165000000.0,238736787.0,7.562447e+08
3,the twilight saga: eclipse,Sum.,300500000.0,2010,53,"Jun 30, 2010",68000000.0,300531751.0,7.061028e+08
4,iron man 2,Par.,312400000.0,2010,15,"May 7, 2010",170000000.0,312433331.0,6.211564e+08

In [111]:
movie_budgets['release_date'] = pd.to_datetime(movie_budgets['release_date'])

In [112]:
movie_budgets_gross.head()

,title,studio,domestic_gross_x,year,id,release_date,production_budget,domestic_gross_y,worldwide_gross
0,toy story 3,BV,415000000.0,2010,47,"Jun 18, 2010",200000000.0,415004880.0,1.068880e+09
1,inception,WB,292600000.0,2010,38,"Jul 16, 2010",160000000.0,292576195.0,8.355246e+08
2,shrek forever after,P/DW,238700000.0,2010,27,"May 21, 2010",165000000.0,238736787.0,7.562447e+08
3,the twilight saga: eclipse,Sum.,300500000.0,2010,53,"Jun 30, 2010",68000000.0,300531751.0,7.061028e+08
4,iron man 2,Par.,312400000.0,2010,15,"May 7, 2010",170000000.0,312433331.0,6.211564e+08

In [113]:
movie_budgets['year'] = movie_budgets['release_date'].dt.year

In [114]:
movie_budgets.columns

Index(['id', 'release_date', 'title', 'production_budget', 'domestic_gross',
       'worldwide_gross', 'year'],
      dtype='object')

In [115]:
movie_info.columns

Index(['id', 'rating', 'genre', 'director', 'runtime'], dtype='object')

In [116]:
#movie_budgets_info = pd.merge(movie_budgets, movie_info, how='inner', on='id')

In [117]:
#movie_budgets_info

In [118]:
movie_genres = {
  "genres": [
    {
      "id": 28,
      "name": "Action"
    },
    {
      "id": 12,
      "name": "Adventure"
    },
    {
      "id": 16,
      "name": "Animation"
    },
    {
      "id": 35,
      "name": "Comedy"
    },
    {
      "id": 80,
      "name": "Crime"
    },
    {
      "id": 99,
      "name": "Documentary"
    },
    {
      "id": 18,
      "name": "Drama"
    },
    {
      "id": 10751,
      "name": "Family"
    },
    {
      "id": 14,
      "name": "Fantasy"
    },
    {
      "id": 36,
      "name": "History"
    },
    {
      "id": 27,
      "name": "Horror"
    },
    {
      "id": 10402,
      "name": "Music"
    },
    {
      "id": 9648,
      "name": "Mystery"
    },
    {
      "id": 10749,
      "name": "Romance"
    },
    {
      "id": 878,
      "name": "Science Fiction"
    },
    {
      "id": 10770,
      "name": "TV Movie"
    },
    {
      "id": 53,
      "name": "Thriller"
    },
    {
      "id": 10752,
      "name": "War"
    },
    {
      "id": 37,
      "name": "Western"
    }
  ]
}

In [119]:
movie_votes.columns

Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [120]:
movie_budgets.columns

Index(['id', 'release_date', 'title', 'production_budget', 'domestic_gross',
       'worldwide_gross', 'year'],
      dtype='object')

In [121]:
movie_votes['title'] = movie_votes['title'].str.strip().str.lower()

In [122]:
movie_votes_subset = movie_votes[['title', 'genre_ids', 'popularity', 'vote_average', 'vote_count']]

movie_budgets_votes = pd.merge(movie_budgets, movie_votes_subset, how='inner', on='title')

In [123]:
movie_budgets_votes.head()

,id,release_date,title,production_budget,domestic_gross,worldwide_gross,year,genre_ids,popularity,vote_average,vote_count
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,"[28, 12, 14, 878]",26.526,7.4,18676
1,2,2011-05-20,pirates of the caribbean: on stranger tides,410600000.0,241063875.0,1.045664e+09,2011,"[12, 28, 14]",30.579,6.4,8571
2,4,2015-05-01,avengers: age of ultron,330600000.0,459005868.0,1.403014e+09,2015,"[28, 12, 878]",44.383,7.3,13457
3,7,2018-04-27,avengers: infinity war,300000000.0,678815482.0,2.048134e+09,2018,"[12, 28, 14]",80.773,8.3,13948
4,9,2017-11-17,justice league,300000000.0,229024295.0,6.559452e+08,2017,"[28, 12, 14, 878]",34.953,6.2,7510

In [124]:
# Convert genre dictionary to a mapping
genre_mapping = {genre['id']: genre['name'] for genre in movie_genres['genres']}

genre_mapping = {int(k): v for k, v in genre_mapping.items()}

# Function to convert genre ids to names
def get_genre_names(ids):
    if isinstance(ids, list):
        
        return [genre_mapping.get(genre_id) for genre_id in ids]
    
    return None

movie_votes['genre_ids'] = movie_votes['genre_ids'].apply(lambda ids: [int(id) for id in ids] if isinstance(ids, list) else ids)

# Apply the function to the genre_ids column
movie_budgets_votes['genre_names'] = movie_budgets_votes['genre_ids'].apply(get_genre_names)

In [125]:
movie_votes['genre_ids'].head()

0        [12, 14, 10751]
1    [14, 12, 16, 10751]
2          [12, 28, 878]
3        [16, 35, 10751]
4          [28, 878, 12]
Name: genre_ids, dtype: object

In [126]:
# Explode the 'genre_ids' column
exploded_movie_budgets = movie_budgets_votes.explode('genre_ids')

exploded_movie_budgets['genre_name'] = exploded_movie_budgets['genre_ids'].map(genre_mapping)

# Check the result
exploded_movie_budgets.head()

,id,release_date,title,production_budget,domestic_gross,worldwide_gross,year,genre_ids,popularity,vote_average,vote_count,genre_names,genre_name
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,"[28, 12, 14, 878]",26.526,7.4,18676,None,NaN
1,2,2011-05-20,pirates of the caribbean: on stranger tides,410600000.0,241063875.0,1.045664e+09,2011,"[12, 28, 14]",30.579,6.4,8571,None,NaN
2,4,2015-05-01,avengers: age of ultron,330600000.0,459005868.0,1.403014e+09,2015,"[28, 12, 878]",44.383,7.3,13457,None,NaN
3,7,2018-04-27,avengers: infinity war,300000000.0,678815482.0,2.048134e+09,2018,"[12, 28, 14]",80.773,8.3,13948,None,NaN
4,9,2017-11-17,justice league,300000000.0,229024295.0,6.559452e+08,2017,"[28, 12, 14, 878]",34.953,6.2,7510,None,NaN

In [127]:
import ast

# Safely convert string representations of lists to actual lists
movie_budgets_votes['genre_ids'] = movie_budgets_votes['genre_ids'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)
exploded_movie_budgets = movie_budgets_votes.explode('genre_ids')  

# Ensure genre_ids are integers
#exploded_movie_budgets['genre_ids'] = exploded_movie_budgets['genre_ids'].astype(int)

# Convert genre_ids to nullable integer
exploded_movie_budgets['genre_ids'] = exploded_movie_budgets['genre_ids'].astype('Int64')

# Map each genre ID to its name, handling NaN values
exploded_movie_budgets['genre_name'] = exploded_movie_budgets['genre_ids'].map(genre_mapping)

In [128]:
exploded_movie_budgets.head()

,id,release_date,title,production_budget,domestic_gross,worldwide_gross,year,genre_ids,popularity,vote_average,vote_count,genre_names,genre_name
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,28,26.526,7.4,18676,None,Action
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,12,26.526,7.4,18676,None,Adventure
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,14,26.526,7.4,18676,None,Fantasy
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,878,26.526,7.4,18676,None,Science Fiction
1,2,2011-05-20,pirates of the caribbean: on stranger tides,410600000.0,241063875.0,1.045664e+09,2011,12,30.579,6.4,8571,None,Adventure

In [129]:
# Create a DataFrame with one-hot encoding for genres
one_hot_genres = pd.get_dummies(exploded_movie_budgets['genre_name'])

# Add movie identifiers to this DataFrame
one_hot_genres['id'] = exploded_movie_budgets['id']
one_hot_genres['title'] = exploded_movie_budgets['title']
one_hot_genres['release_date'] = exploded_movie_budgets['release_date']

# Group by movie identifiers and aggregate
grouped_genres = one_hot_genres.groupby(['id', 'title', 'release_date']).max().reset_index()

In [130]:
# Merge the grouped genre data back with the original movie data
movie_budgets_genres = pd.merge(movie_budgets_votes, grouped_genres, on=['id', 'title', 'release_date'])
movie_budgets_genres.drop('genre_names', axis=1, inplace=True)

In [131]:
genre_columns = ['Action', 'Adventure', 'Animation', 'Comedy', 'Crime', 'Documentary', 'Drama', 'Family', 'Fantasy', 'History', 
                 'Horror', 'Music', 'Mystery', 'Romance', 'Science Fiction', 'TV Movie', 'Thriller', 'War', 'Western']


# Create a new DataFrame to store the primary genre for each movie
primary_genre = pd.DataFrame()

# Iterate through the genre columns and select the one with the highest gross for each movie
for genre in genre_columns:
    primary_genre[genre] = np.where(movie_budgets_genres[genre] == 1, genre, None)

# Create the 'primary_genre' column in the original DataFrame
movie_budgets_genres['primary_genre'] = primary_genre.apply(lambda row: row.dropna().values[0] if not row.dropna().empty else 'Other', axis=1)

# Display the first few rows of the movie_budgets_genres DataFrame with the 'primary_genre' column
movie_budgets_genres.head()

,id,release_date,title,production_budget,domestic_gross,worldwide_gross,year,genre_ids,popularity,vote_average,...,Horror,Music,Mystery,Romance,Science Fiction,TV Movie,Thriller,War,Western,primary_genre
0,1,2009-12-18,avatar,425000000.0,760507625.0,2.776345e+09,2009,"[28, 12, 14, 878]",26.526,7.4,...,0,0,0,0,1,0,0,0,0,Action
1,2,2011-05-20,pirates of the caribbean: on stranger tides,410600000.0,241063875.0,1.045664e+09,2011,"[12, 28, 14]",30.579,6.4,...,0,0,0,0,0,0,0,0,0,Action
2,4,2015-05-01,avengers: age of ultron,330600000.0,459005868.0,1.403014e+09,2015,"[28, 12, 878]",44.383,7.3,...,0,0,0,0,1,0,0,0,0,Action
3,7,2018-04-27,avengers: infinity war,300000000.0,678815482.0,2.048134e+09,2018,"[12, 28, 14]",80.773,8.3,...,0,0,0,0,0,0,0,0,0,Action
4,9,2017-11-17,justice league,300000000.0,229024295.0,6.559452e+08,2017,"[28, 12, 14, 878]",34.953,6.2,...,0,0,0,0,1,0,0,0,0,Action

In [132]:
movie_budgets_genres['primary_genre'].value_counts()

Action             599
Drama              592
Comedy             503
Adventure          192
Horror             155
Crime              137
Animation           93
Documentary         83
Other               25
Thriller            22
Mystery             13
Science Fiction     10
Fantasy              8
Romance              7
Family               4
History              1
TV Movie             1
Western              1
Name: primary_genre, dtype: int64

In [133]:
movie_budgets_genres.drop(genre_columns, axis=1, inplace=True)

In [134]:
movie_budgets_genres.columns

Index(['id', 'release_date', 'title', 'production_budget', 'domestic_gross',
       'worldwide_gross', 'year', 'genre_ids', 'popularity', 'vote_average',
       'vote_count', 'primary_genre'],
      dtype='object')